Revit 2027 API
PartUtils.IsValidForCreateParts Method
 Identifies if the given element can be used to create parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidForCreateParts(
	Document document,
	LinkElementId hostOrLinkElementId
)
Public Shared Function IsValidForCreateParts (
	document As Document,
	hostOrLinkElementId As LinkElementId
) As Boolean
public:
static bool IsValidForCreateParts(
	Document^ document,
	LinkElementId^ hostOrLinkElementId
)
static member IsValidForCreateParts :
        document : Document *
        hostOrLinkElementId : LinkElementId -> bool
Parameters
document Document
 The document.
hostOrLinkElementId LinkElementId
 Id to be tested for validity for creating part.
Return Value
Boolean
 True if this id is valid, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PartUtils Class
Autodesk.Revit.DB Namespace